from smooth import *
#为饼图分类做基础   
x = ['娱乐天地','科技教育','语音直播','单机热游','手游游戏类','网游竞技']
yuyin =['FM233','音乐电台','连麦互动','情感调频','游戏陪玩','交友']
jiaoyu =['鱼教','企鹅直播','设计师','数码科技','汽车','科普','人文军事','纪录片']
yule =['颜值','星娱','二次元','户外','乡野','美食','音乐','一起看','FM233','音乐电台','原创IP','艺能达人']
danjireyou=["主机游戏","热门新游","只狼","隐形守护者","战地风云","怪物猎人","全境封锁","探灵笔记","足球游戏","跳伞行动","全面战争",
            "ATLAS","圣歌","饥荒","NBA2K","骑马与砍杀",'灵魂筹码","JUMP大乱斗',"辐射","SCUM","正当防卫  ","海岛大亨","植物大战僵尸:花园战争系列",
            "血源","仙剑奇侠传""文明6","吞食孔明传","三国志系列","塞尔达传说：梦见岛重制版","仁王","缺氧","环世界","胡闹厨房","鬼泣5","古墓丽影","刺客信条"]
wangyoujingji=["英雄联盟","绝地求生","穿越火线","DNF","DOTA2","APEX英雄","炉石传说","CS:GO",
               "DOTA","魔兽争霸","魔兽世界","格斗游戏","刀塔自走棋","怀旧游戏","逆水寒","QQ飞车端游",
               "跑跑卡丁车","守望先锋","星际争霸","三国杀","剑网3","逆战","传奇","流放之路POE""我的世界",
               "NBA2KOL2","天涯明月刀","风暴英雄","梦幻西游","棋牌娱乐","堡垒之夜","热门网游","泰亚史诗",
               "FIFA ONLINE 4","军事游戏","铁甲雄兵","最终幻想14","街头篮球","迷你世界","问道电脑版","剑灵",
               "竞速游戏","无限法则","反恐精英","暗黑破坏神3","梦三国2","使命召唤OL","斗鱼游戏","星际战甲",
               "群雄逐鹿","征途2","神途","方舟：生存进化","RPG网游专区","古剑奇谭网络版","Artifact","300专区",
               "龙之谷","武侠乂","诛仙3","怪物猎人ol","冒险岛2","高达文化区","激战2","英魂之刃","劲舞团","忍者村大战2",
               "天下3","泡泡堂","永恒之塔","无尽战区","巫师之昆特牌","九阴真经","笑傲江湖OL","刀锋铁骑","万智牌","神之浩劫",
               "新倩女幽魂""天谕","命运2","灵山奇缘""梦想世界","火箭联盟","音乐游戏","枪林弹雨","乐高无限","枪火游侠","火源","战意",
               "心悦大咖秀","罗博造造","手工星球","百变球球","QQ炫舞"]
#csv读取
String_filename =['10','11','12','13','14','15','16','17','18','19','20','21','22']
#时间段
time_period=['10.00','11.00','12.00','13.00','14.00','15.00','16.00','17.00','18.00','19.00','20.00','21.00','22.00']
#折线图
string_class =['英雄联盟','绝地求生','王者荣耀',]
#平滑TOP10
string_class_top10=['绝地求生','王者荣耀','英雄联盟','户外','刺激战场','主机游戏','颜值','DNF','APEX英雄','一起看']
String_filename_1 =[10,11,12,13,14,15,16,17,18,19,20,21,22]
String_filename_1=soomthByStage(String_filename_1,5)
